---
kind: enumMember
id: F:Autodesk.Revit.UI.ExternalEventRequest.Pending
enum: Autodesk.Revit.UI.ExternalEventRequest
source: html/f3a47284-4a83-d8f7-8d97-8235de7be1ba.htm
---
# Autodesk.Revit.UI.ExternalEventRequest.Pending

Request not accepted, because the previous request is still pending (not executed).